Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_system/health_service_agencies.html.txt.tmx
Source language: en
Languages: ga

source: There are a number of agencies and bodies that have a role in delivering health services
ga: Tá líon gníomhaireachtaí agus comhlachtaí ann a bhfuil ról acu maidir le seirbhísí sláinte a sholáthar

source: Some are involved in delivering services while others are regulatory and/or advisory
ga: Baineann cuid díobh le seirbhísí a sholáthar agus is gníomhaireachtaí agus comhlachtaí rialála agus/nó comhairleacha cuid eile díobh

source: There are currently 2 bodies in the health area which are the joint responsibility of the governments of Northern Ireland and Ireland, see Island of Ireland below
ga: Tá 2 chomhlacht ann faoi láthair sa limistéar sláinte a bhfuil rialtais Thuaisceart Éireann agus na hÉireann comhfhreagrach astu, féach ‘Oileán na hÉireann’ thíos

source: Most healthcare is provided within the main structure of the Health Service Executive (HSE)
ga: Soláthraítear an chuid is mó den chúram sláinte laistigh de phríomhstruchtúr Fheidhmeannacht na Seirbhíse Sláinte (FSS)

source: Other agencies which it supports are listed below, as well as websites dealing with specific health issues
ga: Liostaítear thíos gníomhaireachtaí eile lena dtacaíonn siad, mar aon le gach láithreán gréasáin a dhéileálann le saincheisteanna sonracha sláinte

source: Agencies under the remit of the Department of Health
ga: Gníomhaireachtaí faoi shainchúram na Roinne Sláinte

source: CORU, the Health and Social Care Professional Council
ga: Bord Altranais agus Cnáimhseachais na hÉireann

source: Health Information Quality Authority
ga: Údarás Sábháilteachta Bia na hÉireann

source: Health Products Regulatory Authority
ga: An tÚdarás Árachais Sláinte

source: Irish Blood Transfusion Service
ga: An Bord Taighde Sláinte

source: National Paediatric Hospital Development Board
ga: Clárlann Náisiúnta Ailse na hÉireann

source: National Treatment Purchase Fund
ga: Bord Forbartha an Ospidéil Náisiúnta Phéidiatraicigh

source: Nursing and Midwifery Board of Ireland
ga: An Ciste Náisiúnta um Cheannach Cóireála

source: Pharmaceutical Society of Ireland
ga: Cumann Cógaiseoirí na hÉireann

source: Pre-Hospital Emergency Care Council
ga: An Chomhairle um Chúram Éigeandála Réamhospidéil

source: Also the VHI, which is a commercial State body
ga: Agus an VHI, ar comhlacht tráchtála Stáit iad
